<template>
  <div class="container">
    <div class="RoPlaces">
      <h2 class="RoPlaces_title">Места РО по показателям</h2>
      <div class="RoPlaces_wrapper">
        <router-link to="/" v-for="item in RoPlaces" :key="item.id" class="RoPlaces_item">
          <p>{{ item.id }}.</p>
          <p>{{ item.title }}</p>
        </router-link>
      </div>
    </div>
  </div>
</template>
<script setup>
import { ref } from 'vue';

const RoPlaces = ref([{
  id: 1, title: 'Численность членов РО РСО в соответствии с объемом уплаченных членских взносов'
}, {
  id: 2, title: 'Отношение численности членов РО РСО к численности студентов очной формы обучения субъекта Российской Федерации, обучающихся в профессиональных образовательных организациях и образовательных организациях высшего образования в государственных, муниципальных и частных образовательных организациях, включая филиалы (исключения — учебные заведения специальных ведомств, проводящих обучение на казарменном положении)',
}, {
  id: 3, title: 'Прирост численности членов РО РСО относительно количества членов в соответствии с отчетом РО РСО за 2023 г.',
}, {
  id: 4, title: 'Организация всероссийских (международных), окружных и межрегиональных мероприятий и проектов (слеты, школы, фестивали, турниры и прочие)',
}, {
  id: 5, title: 'Организация всероссийских (международных) (организатор — региональное отделение РСО), окружных и межрегиональных трудовых проектов в соответствии с Положением об организации трудовых проектов РСО',
}, {
  id: 6, title: 'Участие бойцов студенческих отрядов РО РСО во всероссийских (международных) мероприятиях и проектах (в том числе и трудовых) «К»',
}, {
  id: 7, title: 'Победители студенческих отрядов РО РСО во всероссийских (международных) проектах и конкурсах «К»',
}, {
  id: 8, title: 'Количество упоминаний в СМИ о прошедших творческих, добровольческих и патриотических мероприятиях и трудовых проектах, организованных РО РСО «К»',
}, {
  id: 9, title: 'Организация обязательных общесистемных мероприятий РСО на региональном уровне «К»',
}, {
  id: 10, title: 'Организация РО РСО всероссийских (международных) добровольческих и патриотических акций «К»',
}, {
  id: 11, title: 'Активность РО РСО в социальных сетях «К»',
}, {
  id: 12, title: 'Объем средств, собранных бойцами РО РСО во Всероссийском дне ударного труда',
}, {
  id: 13, title: 'Охват членов РО РСО, принявших участие во Всероссийском дне ударного труда «К»',
}, {
  id: 14, title: 'Отношение объема средств, собранных бойцами РО РСО во Всероссийском дне ударного труда к количеству членов РО РСО, принявших участие во Всероссийском дне ударного труда',
}, {
  id: 15, title: 'Исполнительская дисциплина РО РСО, соблюдение условий охраны труда на трудовых проектах РСО, наличие проблемной неурегулированной задолженности по выплате заработной платы перед бойцами РСО за трудовой семестр предыдущего года, отсутствие отчислений от членских взносов в Центральный штаб, исполнение решений Центральных руководящих органов РСО, наличие ежегодного акта проверки КРК РО РСО',
}, {
  id: 16, title: 'Победители всероссийских (международных), окружных и межрегиональных трудовых проектов по комиссарской деятельности «К»',
}])
</script>
<style lang="scss">
.RoPlaces {
  padding-bottom: 80px;

  &_title {
    font-size: 52px;
    font-weight: 700;
    color: #35383F;
    font-family: 'Akrobat';
  }

  &_wrapper {
    margin-top: 40px;
    display: flex;
    flex-direction: column;
    row-gap: 8px;
  }

  &_item {
    cursor: pointer;
    max-width: 100%;
    padding: 16px;
    width: 100%;
    border: 0px 0px 0px 6px;
    border-radius: 10px;
    background-color: #F3F4F5;
    border-left: 6px solid #1F7CC0;
    height: auto;
    display: flex;
    align-items: flex-start;
    column-gap: 3px;

    p {
      line-height: 24px;
      font-size: 20px;
      color: #000000;
      font-weight: 600;
      font-family: 'Akrobat';
    }
  }
}
</style>