const actions = [
    {
        id: 1,
        name: 'Спевка',
        description: 'Важное мероприятие. Быть всем!',
        date: '29 февраля 2024',
        groupReq: '200',
        tag: "Образовательное",
        range: "Всероссийское"
    },
    {
        id: 1,
        name: 'Подготовка танца',
        description: 'Важное мероприятие. Быть всем!',
        date: '29 февраля 2024',
        groupReq: '200',
        tag: "Образовательное",
        range: "Всероссийское"
    },
    {
        id: 1,
        name: 'Спортивные мероприятия',
        description: 'Важное мероприятие. Быть всем!',
        date: '29 февраля 2024',
        groupReq: '200',
        tag: "Образовательное",
        range: "Всероссийское"
    },
    {
        id: 1,
        name: 'День рождения отряда',
        description: 'Важное мероприятие. Быть всем!',
        date: '29 февраля 2024',
        groupReq: '200',
        tag: "Образовательное",
        range: "Всероссийское"
    },{
        id: 1,
        name: 'Спевка',
        description: 'Важное мероприятие. Быть всем!',
        date: '29 февраля 2024',
        groupReq: '200',
        tag: "Образовательное",
        range: "Всероссийское"
    },{
        id: 1,
        name: 'Спевка',
        description: 'Важное мероприятие. Быть всем!',
        date: '29 февраля 2024',
        groupReq: '200',
        tag: "Образовательное",
        range: "Всероссийское"
    }];
//Экспорт списка
export default actions